f = open("myName.txt","w")
f.write("Salam man yechizi neveshtam")
f.close()

f = open("myName.txt")
print(f.read())
f.close()

#=======================================================================

# "r" → فقط خواندن

# "w" → فقط نوشتن (اگر فایل وجود داشته باشه پاک میشه)

# "a" → افزودن به انتهای فایل

# "b" → حالت باینری

# "t" → حالت متنی (پیش‌فرض)

# "x" → ایجاد فایل جدید (اگر وجود داشته باشه خطا میده)

f = open("test.txt", "w")  # ایجاد و باز کردن برای نوشتن
f.write("سلام دنیا\n")
f.close()


#====================================================================

# نوشتن
with open("data.txt", "w", encoding="utf-8") as f:
    f.write("خط اول\nخط دوم")

# خواندن
with open("data.txt", "r", encoding="utf-8") as f:
    content = f.read()
    print(content)

#====================================================================

# read() → کل فایل رو می‌خونه

# readline() → فقط یک خط می‌خونه

# readlines() → کل خط‌ها رو به صورت لیست برمی‌گردونه

# seek(pos) → تغییر مکان در فایل

# tell() → موقعیت فعلی مکان‌نما (cursor)

with open("data.txt", "r", encoding="utf-8") as f:
    print(f.readline())  # خط اول
    print(f.tell())      # مکان‌نما بعد از خط اول
    f.seek(0)            # برگردوندن مکان‌نما به اول
    print(f.readline())  # دوباره خط اول

#=====================================================================

